app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 10)
---
SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"